{
  "songName": "Wasted Times",
  "spotifyLink": "https://open.spotify.com/track/7DKS0rX27cCEPsK0R6tFWS?si=01d590680d874862",
  "genre": "R&B",
  "lyrics": "Wasted times I spent with someone else\nShe wasn't even half of you\nReminiscin' how you felt (-niscin' how you felt)\nAnd even though you put my life through hell\nI can't seem to forget 'bout you, 'bout you\nI want you to myself\nAnd now I'm askin', who do you belong to now?\nWho you give that love to now?\nWho you pullin' up on?\nWho you gettin' sprung for now?\nAnd what they got that I ain't got? 'Cause I got a lot\nDon't make me run up on 'em, got me blowin' up their spot\n'Cause I ain't got no business catchin' feelings anyway\nI ain't got no business catchin' feelings\nCatchin' feelings\nThese girls only want you when you're winnin' (winnin')\nBut you've been with me from the beginnin' (ooh, yeah, yeah)\nAnd I know right now that we're not talkin' (not talkin')\nI hope you know this dick is still an option\n'Cause I'll beat it up (I'll beat it up, yeah)\nI took my time to learn the way your body functions\nYou were equestrian, so ride it like a champion (ride it baby)\nThis sex will get you high without no other substance\nSo who do you belong to now? (Who do you belong to now?)\nWho you give that love to now? (Who you give that love to now?)\nWho you pullin' up on?\nWho you gettin' sprung for now? (Who you gettin' sprung for now?)\nAnd what they got that I ain't got? 'Cause I got a lot (I got a lot)\nDon't make me run up on 'em, got me blowin' up their spot (blowin' up their spot)\n'Cause I ain't got no business catchin' feelings anyway\nI ain't got no business catchin' feelings (feelings)\nCatchin' feelings\nI ain't got no business catchin' feelings\nI ain't got no business catchin' feelings\nCatchin' fee-fee-fee-fee\nFeelings\nI ain't got no business catchin' feelings\nI ain't got no business catchin' feelings\nCatchin' fee-fee-fee-fee\nWake up\nI don't wanna wake up\nI don't wanna wake up\nIf you ain't layin' next to me\nI don't wanna wake up\nI don't wanna wake up\nI don't wanna wake up\nIf you ain't layin' next to me-e-e\nOn me, me, on me, oh, I\nOn me, on me, on me"
}

